#include <stdio.h>

////1. Да се напише програма која чита знак од тастатура и во зависнот од тоа дали е мала или голема буква печати 1 или 0, соодветно.
////Бонус: Направете проверка дали знакот е цифра
//int main()
//{
//    char x;
//    int y;
//    scanf("%c",&x);
//    y = (x >= 'a') && (x <= 'z');
//    printf("%d\n",y);
//    y = (x >= '0') && (x <= '9');
//    printf("%d",y);
//    return 0;
//}

////2. Да се напише програма која ќе чита два цели броеви (x, y) од тастура и на компјутерскиот екран ќе го испечати резултатот (z) од следниот израз
////z = x++ + --y + (x<y)
//int main()
//{
//    int x, y;
//    scanf("%d%d",&x,&y);
//    int z;
//    z = x++ + --y + (x<y);
//    printf("%d",z);
//    return 0;
//}

////3.
////Каква вредност ќе има r за x=1, y=2, z=3?
////Каква вредност ќе има z?
//int main()
//{
//    int x=1, y=2, z=3;
//    int r;
//    r = (x<y || y<z++);
//    printf("%d\n",r);
//    printf("%d",z);
//    return 0;
//}

//4.
//int main()
//{
//  int x, y;
//  y = scanf("%d", &x);
//  printf("y = %d\n", y);
//  return 0;
//}
//int main() {
//  int x, y, z;
//  z = scanf("%d%d", &x, &y);
//  printf("z = %d\n", z);
//  return 0;
//}

////5.Да се напише програма каде од тастатура ќе се внесе цена на производ, а потоа ќе ја испечати неговата цена со пресметан ддв.
//int main()
//{
//    float a;
//    scanf("%f",&a);
//    printf("%f", a*1.18);
//    return 0;
//}

////6. Да се напише програма каде од тастатура ќе се внесе цена на производ, број на рати на кои се исплаќа и камата (каматата е број изразен во проценти од 0 до 100). Програмата треба да го испечати износот на ратата и вкупната сума што ќе се исплати за производот
//
//int main()
//{
//    int cena;
//    int rati;
//    float kamata;
//    float vcena;
//    float IznosNaRata;
//
//    printf("Cenata e: ");
//    scanf("%d",&cena);
//    printf("Broj na rati: ");
//    scanf("%d",&rati);
//    printf("Kamata: ");
//    scanf("%f",&kamata);
//
//    vcena = cena * (1 + kamata/100);
//    IznosNaRata = (cena/rati) * (1 + kamata/100);
//
//    printf("Novata cena e: %.0f\n",vcena);
//    printf("Rata so kamata e: %.0f",IznosNaRata);
//
//    return 0;
//}

////7. Да се напише програма каде од тастатура ќе се внесе трицифрен цел број. Програмата ќе ја испечати најзначајната и најмалку значајната цифра од бројот
//int main()
//{
//    int x;
//    scanf("%d",&x);
//    printf("%d\n", x/100);
//    printf("%d", x%10);
//    return 0;
//}
