#include <stdio.h>


//1. Да се напише програма што ќе ја испечати сумата на сите броеви деливи со 3 во интервалот [A,B). А и B се внесуваат од тастатура.
//Објаснување на примерот.
//А=10, B = 20. Броеви кои припаѓаат во интервалот се 10,11,12,13,..,19. Од нив деливи со 3 се броевите 12,15,18, па нивната сума е 45.
//int main()
//{
//    int a, b, suma=0;
//    scanf("%d %d",&a,&b);
//
//    while(a<b)
//    {
//        if(a%3==0)
//        suma+=a;
//    a++;
//    }
//
//    printf("%d",suma);
//
//    return 0;
//}

//2. Од стандарден влез се вчитува број N, а потоа и N цели броеви.
//Да се испечати на екран најголемата разлика помеѓу два последователно внесени броја.
//Да се реши без користење на низи!
//Објаснување на примерот:
//N=5, па се внесуваат 5 броја: 1,3,0,5,2. Разликите се соодветно:
//3-1 = 2
//0-3 = -3
//5-0 = 5
//2-5 = -3
//Најголема разлика е 5.
int main()
{
    int n, a, temp;
    int x=0;
    int razlika;
    int pb=1;
    scanf("%d %d",&n,&temp);

    while(x<(n-1))
    {
        scanf("%d",&a);
        if(((a-temp)>razlika) || pb)
        {
            razlika=a-temp;
            pb=0;
        }
    temp=a;
    x++;
    }
    printf("%d",razlika);
    return 0;
}

//3. Од тастатура се внесуваат цели броеви се додека не се внесе нешто што не е цел број.
//Да се испечати на екран сумата на броевите во кои цифрите се подредени во опаѓачки редослед. Доколку нема такви броеви, да се испечати порака NEMA.
//Објаснување на примерот:
//Во првиот пример, нема ниту еден број во кој цифрите се подредени во опаѓачки редослед, па се печати NEMA.
//Во вториот пример, во 4321, 21 и 81, цифрите се подредени во опаѓачки редослед, па се печати нивната сума 4423.
//NE RABOTI
//#include <stdio.h>
//
//int main()
//{
//    int n, suma;
//    int b, z, k;
//    suma=0;
//    while(scanf("%d",&n))
//    {
//        b=1;
//        z=n;
//        k=n%10;
//        z=z/10;
//        while(z>0)
//        {
//            if(!((z%10)>k))
//            {
//            b=0;
//            break;
//            }
//                    z=z/10;
//
//        }
//        k=z%10;
//    }
//    if(b==1)
//        suma=suma+n;
//    if(suma==0)
//        printf("NEMA");
//    else
//        printf("%d",suma);
//    return 0;
//}

//ISTATA RESENA SO FOR CIKLUS
//#include <stdio.h>
//
//int main()
//{
//    int a, b, c, z, suma;
//    suma=0;
//    for (c=1;scanf("%d",&a);)
//    {
//    c=1;
//    z=a;
//    b=a%10;
//    z=z/10;
//    while(z>0)
//    {
//        if(!(z%10>b))
//        {
//            c=0;
//            break;
//        }
//    b=z%10;
//    z=z/10;
//    }
//    if(c==1)
//        suma=suma+a;
//    }
//    if(suma==0)
//        printf("NEMA");
//    else
//        printf("%d",suma);
//    return 0;
//}
